type Filter = {
  label: string,
  value: string,
}
export const genres: Filter[] = [
  {
    label: 'Триллер',
    value: 'триллер',
  },
  {
    label: 'Драма',
    value: 'драма',
  },
  {
    label: 'Криминал',
    value: 'криминал',
  },
  {
    label: 'Мелодрама',
    value: 'мелодрама',
  },
  {
    label: 'Детектив',
    value: 'детектив',
  },
  {
    label: 'Фантастика',
    value: 'фантастика',
  },
  {
    label: 'Приключения',
    value: 'приключения',
  },
  {
    label: 'Биография',
    value: 'биография',
  },
  {
    label: 'Фильм-нуар',
    value: 'фильм-нуар',
  },
  {
    label: 'Вестерн',
    value: 'вестерн',
  },
  {
    label: 'Боевик',
    value: 'боевик',
  },
  {
    label: 'Фэнтези',
    value: 'фэнтези',
  },
  {
    label: 'Комедия',
    value: 'комедия',
  },
  {
    label: 'Военный',
    value: 'военный',
  },
  {
    label: 'История',
    value: 'история',
  },
  {
    label: 'Документальный',
    value: 'документальный',
  },
  {
    label: 'Музыка',
    value: 'музыка',
  },
  {
    label: 'Ужасы',
    value: 'ужасы',
  },
  {
    label: 'Спорт',
    value: 'спорт',
  },
  {
    label: 'Семейный',
    value: 'семейный',
  },
  {
    label: 'Детский',
    value: 'детский',
  },
  {
    label: 'Для взрослых',
    value: 'для взрослых',
  },
]

export const years = [
  {
    label: '2020-2023',
    value: '2020-2023',
  },
  {
    label: '2016-2019',
    value: '2016-2019',
  },
  {
    label: '2012-2015',
    value: '2012-2015',
  },
  {
    label: '2008-2011',
    value: '2008-2011',
  },
  {
    label: '2004-2007',
    value: '2004-2007',
  },
  {
    label: '2000-2003',
    value: '2000-2003',
  },
  {
    label: '1990-1999',
    value: '1990-1999',
  },
  {
    label: '1980-1989',
    value: '1980-1989',
  },
  {
    label: '1970-1979',
    value: '1970-1979',
  },
  {
    label: '1960-1969',
    value: '1960-1969',
  },
  {
    label: 'до 1960',
    value: '1900-1959',
  },
];

export const ratings = [
  {
    label: 'больше 9',
    value: '9-10',
  },
  {
    label: 'больше 8',
    value: '8-10',
  },
  {
    label: 'больше 7',
    value: '7-10',
  },
  {
    label: 'больше 6',
    value: '6-10',
  },
];

export const sortFields = [
  {
    label: 'По популярности',
    value: 'votes.kp',
  },
  {
    label: 'По рейтингу',
    value: 'rating.kp',
  },
  {
    label: 'По дате добавления',
    value: 'year',
  },
];


// export const genres = [
//   'триллер',
//   'драма',
//   'криминал',
//   'мелодрама',
//   'детектив',
//   'фантастика',
//   'приключения',
//   'биография',
//   'фильм-нуар',
//   'вестерн',
//   'боевик',
//   'фэнтези',
//   'комедия',
//   'военный',
//   'история',
//   'документальный',
//   'музыка',
//   'ужасы',
//   'спорт',
//   'семейный',
//   'детский',
//   'для взрослых',
// ]


// export const years: string[] = [
//   '2020-2023',
//   '2016-2019',
//   '2012-2015',
//   '2008-2011',
//   '2004-2007',
//   '2000-2003',
//   '1990-1999',
//   '1980-1989',
//   '1970-1979',
//   '1960-1969',
//   'до 1960'
// ];


// export const years: string[] = [
//   'больше 9',
//   'больше 8',
//   'больше 7',
//   'больше 6',
// ];


// export const sortings: string[] = [
//   'по популярности',
//   'по рейтингу',
//   'по дате добавления',
// ];
