export const filters = [
  'триллер',
  'драма',
  'криминал',
  'мелодрама',
  'детектив',
  'фантастика',
  'приключения',
  'биография',
  'фильм-нуар',
  'вестерн',
  'боевик',
  'фэнтези',
  'комедия',
  'военный',
  'история',
  'документальный',
  'музыка',
  'ужасы',
  'спорт',
  'семейный',
  'детский',
  'для взрослых',
]

export const years: string[] = [
  '2020-2023',
  '2016-2019',
  '2012-2015',
  '2008-2011',
  '2004-2007',
  '2000-2003',
  '1990-1999',
  '1980-1989',
  '1970-1979',
  '1960-1969',
  'до 1960'
];

export const ratings: string[] = [
  'больше 9',
  'больше 8',
  'больше 7',
  'больше 6',
];

export const sortings: string[] = [
  'по популярности',
  'по рейтингу',
  'по дате добавления',
];
